
export const aboutUsContent = {
  title: "Про Нас",
  title2: "Розробники",
  mainText: [
    "Цей сайт присвячений життю і творчості видатного українського філософа — Григорія Савича Сковороди.",
    "Мета проекту — заохотити людей до читання Сковороди 📖, вивчення його біографії та філософії Життя.",
    "Проект заснований на волонтерських засадах і є некомерційним. 🙏",
  ],
  dimaDescription: [
    "Горецький Дмитро Сергійович",
    "Відповідає за дизайн, розробку та просування сайту; а також за збір інформації.",
    "Маркіз Дмитрович. Ні за що не відповідає, але підтримує морально і надихає. 😸",
  ],
  olenkaDescription: [
    "Лещенко Олена Олександрівна",
    "Відповідає за ілюстрацію до байок; за збір інформації.",
  ],
  dimaImage: {
    imageUrl: "/images/Dima.jpg",
    imageAlt: "Горецький Дмитро Сергійович",
    imageTitle: "Горецький Дмитро Сергійович",
  },
  olenkaImage: {
    imageUrl: "/images/Olenka.jpg",
    imageAlt: "Лещенко Олена Олександрівна",
    imageTitle: "Лещенко Олена Олександрівна",
  },
};