import { homePageKey } from "../skovorodaConstants";

export function getHomePageProps() {
  return {
    props: {
      pageKey: homePageKey,
      metadataTitle: "Григорій Савич Сковорода — Український Філософ",
      metadataDescription: "Філософ-містик, богослов, поет, педагог і композитор літургійної музики. Мав значний вплив на сучасників і подальші покоління своїми байками, піснями, філософськими творами, а також способом життя, через що його називають ”Українським Сократом”.",
      metadataKeywords: ["Григорій Савич Сковорода", "Григорій Сковорода","Український філософ","Філософія Сковороди"],
      shouldBeIndexed: true,
    },
  };
}

export const homePageContent = {
  imageUrl: "/images/SkovorodaPortrait-transformed2.jpg",
  imageTitle: "Портрет Сковороди",
  imageAlt: "Портрет Сковороди",
  titleLine: "Григорій Савич Сковорода",
  birthLine: "22 листопада 1722 — 29 жовтня 1794",
  shortBio: "Український філософ-містик, богослов, поет, педагог і композитор літургійної музики. Мав значний вплив на сучасників і подальші покоління своїми байками, піснями, філософськими творами, а також способом життя, через що його називають ”Українським Сократом”.",
  symbolsText: 'Бог подібний до багатого фонтана, що наповнює різні посудини за їх місткістю. Над фонтаном оцей напис: "Нерівна усім рівність". Ллються із різних трубок різні струмені у різні посудини, що стоять навколо фонтана. Менша посудина має менше, однак у тому дорівнює більшій, що однаково повна.',
};