
const skovorodaPlaces = {
  chornuhy: {
    id: "chornuhy",
    title: "Чорнухи",
    // https://uk.wikipedia.org/wiki/%D0%A7%D0%BE%D1%80%D0%BD%D1%83%D1%85%D0%B8
  },
  kyivo_mohylyanska_akademia: {
    id: "kyivo_mohylyanska_akademia",
    title: "Києво-Могилянська академія",
    // https://uk.wikipedia.org/wiki/%D0%9A%D0%B8%D1%94%D0%B2%D0%BE-%D0%9C%D0%BE%D0%B3%D0%B8%D0%BB%D1%8F%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D0%B0%D0%BA%D0%B0%D0%B4%D0%B5%D0%BC%D1%96%D1%8F_(1659%E2%80%941817)
  },
  prydvorna_kapela: {
    id: "prydvorna_kapela",
    title: "Придворна капела",
    // Санкт-Петербург
  },
};

const skovorodaStates = {
  child: {
    id: "child",
  },
  child_at_school: {
    id: "child_at_school",
  },
  student_at_kyiv: {
    id: "student_at_kyiv",
  },
  singer_at_kapela: {
    id: "singer_at_kapela",
  },
};

function date(year, month, day) {

}

const timePoints = [
  { 
    id: "day-of-birth",
    date: date(1772, 12, 3), 
    state: skovorodaStates.child,
    place: skovorodaPlaces.chornuhy,
    text: "Народився в сотенному містечку Чорнухи Любенського полку.",
    source: 1,
    sourcePage: "29 с.",
    // TODO: 
    // Можна додати про батьків. 
    // Можна додати вірш Сковороди написаний Ковалинському про свій день народження (див. Ловитва 29 с.) 
  },
  {
    id: "go-to-school",
    date: date(1729),
    endDate: date(1734, "summer"), // [1] 47 c.
    state: skovorodaStates.child_at_school,
    place: skovorodaPlaces.chornuhy,
    text: "Батьки віддали Григорія до дяківської школи",
    source: 1,
    sourcePage: "40 с.",
    // Грав на флейті [1] 46 c.
    // З 7 років почав співав у церковному хорі [1] 44 c.
    // З дитинства любив читати [1] 44 c.
  },

  {
    id: "student_at_kyiv_1",
    date: date(1734, "august"),
    endDate: date(1741, "december", "6-8"), // [1] 90 c.
    state: skovorodaStates.student_at_kyiv,
    place: skovorodaPlaces.kyivo_mohylyanska_akademia,
    text: "Студент Києво-Могилянської академії",
    source: 1,
    sourcePage: "48 с.",
  },
  
  // 1734-1735 
  // Перший клас - аналогія, чи фара. (Граматика книжної української та польської мов, поступово латинська мова)
  // Викладач: ієродиякон Веніамін Григорович
  // [1] 55 c.

  // Другий клас - нижчий, або ініфіма 
  // Третій клас - середній, або граматика
  // Четвертий клас - вищий, або синтаксима
  // 2-4 клас вивчали майже виключно латинську мову [1] 56 с.
  // Навчаючись у класі поетики Сковорода починає відвідувати екстраординарні класи мов: грецької, німецької та єврейської
  // Співав в хорі [1] 68 c.

  // В Глухові музична школа. Саме в цій школі в грудні 1741 ркоу Сковорода пройшов конкурсний відбір 
  // (випробуванн в церковному співі та в співі на "італійський манір")
  // альтист придворної капели імператриці Єлизавети
  // [1] 96 c.

  {
    id: "prydvorna_kapela",
    date: date(1741, "december", "6-8"),
    // 21 грудня 1741 року Сковорода прибуває до Санкт-Петербурга [1] 98 с. 
    endDate: date(1744),
    state: skovorodaStates.singer_at_kapela,
    place: skovorodaPlaces.prydvorna_kapela,
    source: 1,
    sourcePage: "90 с.",
    // Співаки придворної капели мешкали тоді в старому Зимовому палаці [1] 98 с. 
  },
  
  // 28 лютого 1742 Москва [1] 101 c. Там співав Сковорода. Урочиста відправа в Успенському соборі Кремля. 
  // 28 квітня 1742 урочиста коронація в тому ж соборі. Виступав Сковорода з хором теж, опера "La clemenza di Tito".
  // цю опера ще двічі в Москві на початку 1743 року, а потім декілька разів в Санкт-Петербурзі
  // грудень 1742 повертається до Санкт-Петербурга, і ввесь 1743 в Санкт-Петербурзі
  // саме в цей час Сковорода склав наспів духовної пісні "Іже Херувими", 
  // веселий і урочистий наспів "Христос воскресе" і канон "Воскресеніє день"
  // 21 січня 1744 року Петербург - Москва
  // 29 червня 1744 року Сковорода співав на урочистостях заручин княгині і княза [1] 116 c.
  // кінець серпня 1744 року Київ з Єлизаветою .. 11 вересня імператриця поїхада до Глухова .. Сковорода залишився в Київі [1] 121 c.
  // повертаэться до навчання у клас філософії 

];

export const SkovorodaTravelData = {
  timePoints,
};
