
export const recommendedTreatisesList = [
  {
    id: "vstupni_dveri_do_khrystyianskoi_dobronravnosti",
    comments: "Короткий катехизис - виклад основ віри в Бога.",
  },
  {
    id: "blahodarnyi_erodii",
    comments: "Притча про виховання та вдячність."
  },
  {
    id: "ubohii_zhaivoronok",
    comments: "Притча про виховання та небезпеки світу.",
  },
  {
    id: "rozmova_pyiaty_podoroznih_pro_shasta",
    comments: "Притча у формі діалога про пошуки щастя. Містить в собі декілька невеликих притч.",
  },
  {
    id: "narcis",
    comments: "Найвідоміший і найважливіший твір Сковороди, вважається першим оригінальним філософським твором в Україні. Основна тема твору: Пізнай Себе!",
  },
  {
    id: "bukvar_myru",
    comments: "Важливий твір, який розкриває ідею сродності.",
  },
  {
    id: "ikona_alkiviadska",
    comments: "В цьому творі філософ чітко формулює свою концепцію двох натур (видимої і невидимої, тлінної і вічної) і трьох світів (макрокосму — природи, мікрокосму — людини і світу символів — Біблії).",
  },
];