import { parseFileContent } from "../data/utils/readingTextsUtils";
import { aboutUsPageKey } from "../skovorodaConstants";

const content1 = `
Cайт присвячений життю і творчості видатного українського філософа — Григорія Савича Сковороди.
`.trim();

const content2 = `
Сковорода ставив на перше місце Бога і роздуми над Святим Письмом як спосіб пізнання Христа, Людини Істинної. Так само і в нас головним завданням є не лише пізнання Сковороди як особистості (хоч це теж важливо), а передусім пізнання Людини з великої літери, благих ідей, самих себе і Бога.
Сковорода рідко дискутує з іншими богословами чи тлумачами Біблії — його більше цікавить зерно, ядро істини, приховане в образах Богонатхненних Писань. Він, безперечно, читав і надихався різними інтерпретаторами, і ми також заохочуємо до цього тих, хто має [LINK]https://www.skovoroda.club/themes/srodnist[LINK_SEPARATOR]сродність[LINK] і щире прагнення. Але завжди пам’ятаємо: [Bold]Бог — всьому Голова[Bold].

Для нас ціннішим є людське Благо і порух душі ніж строгий, сухий науковий підхід. Ми більше про відверту глибоку розмову, про дослідження себе і прикладні цінності, ніж про теоритизацію і безплідні дослідження.

Ось декілька цитат Сковороди про ціль його трудів:
«Вельми я буду радий, якщо ця книжечка послужить для прогнання лише кількох днів суму, але який я задоволений, якщо вона [Bold]посприяє хоч краплині внутрішнього миру[Bold].» — [Italic]присвята до трактату [LINK]https://www.skovoroda.club/texts/treatise/kilce[LINK_SEPARATOR]«Кільце»[LINK], переклад Кашуби[Italic].
«Якщо ця книжечка хоча б кілька хвилин послужить Вам проти біса нудьги, то й тим я задоволений. Якщо ж [Bold]напоїть хоча б маленькою чашечкою спасення миру Божого[Bold] – ось мені й труд, і плід, і нагорода!» — [Italic]присвята до перекладу «Плутархової книжечки Про Спокій Душі», переклад Кашуби[Italic].

Проект заснований на волонтерських засадах і є некомерційним. 🙏
Якщо маєте бажання допомогти — [LINK]https://t.me/Horetskyi_Dima[LINK_SEPARATOR]пишіть нам в телеграм[LINK].
Код проекту у відкритому доступі: [LINK]https://github.com/Horetskyi/skovoroda[LINK]
`.trim();

const content3 = `
[AllIsList]
Горецький Дмитро – засновник проекту, відповідає за технічну сторону сайту, за структуру, дизайн, тексти і підбір матеріалів.
Горецька Олена – ілюстраторка, редакторка текстів.
Герман Ольга – допомагає з оцифровуванням текстів.
Аня Рубан – ілюстраторка.
Поліна Огірчук – ілюстраторка.
Ольга Райхель – ілюстраторка.
Софія – ілюстраторка.
Яна – дизайнерка.
Жук Анна – ілюстраторка.
`.trim();

const contentStructure = {
  sections: [
    {
      h1: 'Про нас (Skovoroda Club)',
      content: parseFileContent(content1),
    },
    {
      h2: 'Мета проекту',
      content: parseFileContent(content2),
    },
    {
      h2: 'Команда',
      content: parseFileContent(content3),
    }
  ]
};

export function getAboutUsPageProps() {

  return {
    props: {
      pageKey: aboutUsPageKey,
      metadataTitle: "Про Нас - Skovoroda Club",
      metadataDescription: "Сайт присвячений життю і творчості видатного українського філософа — Григорія Савича Сковороди",
      metadataKeywords: ["Григорій Сковорода", "Команда", "Skovoroda Club", "Про нас"],
      metadataAuthorUrl: "https://www.linkedin.com/in/dmytro-horetskyi/",
      shouldBeIndexed: true,
      canonicalPageUrl: "https://www.skovoroda.club/about-us",
      contentStructure: contentStructure,
    },
  };
}
