

export const aboutUsContent = {
  title: "Про Нас",
  title2: "Розробники",
  dimaDescription: [
    "Горецький Дмитро Сергійович",
    "Відповідає за дизайн, розробку та просування сайту; а також за збір інформації.",
    "Маркіз Дмитрович. Ні за що не відповідає, але підтримує морально і надихає. 😸",
  ],
  olenkaDescription: [
    "Лещенко Олена Олександрівна",
    "Відповідає за ілюстрацію до байок та за збір інформації.",
  ],
  dimaImage: {
    imageUrl: "/images/Dima.jpg",
    imageAlt: "Горецький Дмитро Сергійович",
    imageTitle: "Горецький Дмитро Сергійович",
  },
  olenkaImage: {
    imageUrl: "/images/Olenka.jpg",
    imageAlt: "Лещенко Олена Олександрівна",
    imageTitle: "Лещенко Олена Олександрівна",
  },
};