export const copyrightContent = {
  title: "Авторське право",
  content: [
    "Усі матеріали, які захищаються авторським правом, викладені на сайті https://www.skovoroda.club/ виключно з метою ознайомлення або навчальною метою і не можуть використовуватися з комерційною метою без погодження з відповідними власниками авторських прав.",
    "Будь-який вміст, що порушує чиєсь авторське право, якщо такий є на сайті, вилучається на прохання власника авторських прав або іншої особи, якщо така особа має право вимоги щодо вилучення матеріалів.",
    "Ми раді співпрацювати з авторами та перекладачами літературних творів, готові надавати їм найширше сприяння та підтримку в межах своїх можливостей.",
  ],
}