{
  "urlId": "ubohii_zhaivoronok",
  "orderNumber": 18,
  "treatiseType": "Притча",
  "writtenDate": [
    {
      "year": 1787,
      "text": "написаний 1787 р.",
      "sourceId": 3
    }
  ],
  "versions": [
    {
      "translatorId": 0,
      "sourceId": 3,
      "title": "Убогій Жайворонок",
      "fileNames": [
        "Г. С. Сковорода - Убогій Жайворонок - Л. Ушкалов.pdf"
      ]
    },
    {
      "translatorId": 4,
      "sourceId": 4,
      "title": "Убогий Жайворонок",
      "fileNames": [
      ]
    },
    {
      "translatorId": 2,
      "sourceId": 13,
      "title": "Убогий Жайворонок",
      "fileNames": [
        "Г. С. Сковорода - Убогий Жайворонок - В. Шевчук.pdf",
        "Г. С. Сковорода - Убогий Жайворонок - В. Шевчук.docx"
      ],
      "preferedVersion": true
    }
  ],
  "quotes": [
    {
      "translatorId": 4,
      "texts": [
        "Життя наше — це безперервний шлях. Цей світ є велике море для всіх нас, плавців. Він-то є океан, о, який безбідно перепливають дуже небагато щасливців. На цьому шляху зустрічаються камʼяні скали і скалки, на островах — сирени, на глибинах — кити, у повітрі — вітри, хвилювання скрізь; від каменів — спотикання, від сирен — спокуса, від китів — поглинання, від вітрів — спротив, від хвиль — поринання. Камʼяні ж спокуси — це невдачі; сирени — це обласні друзі; кити — це запазушні змії наших пристрастей; вітри, розумій, напасті, хвилювання, мода й суєта життєйська…",
        "Не дрімає ловець. Не спи і ти. Необачність є матірʼю нещастя.",
        "Не той дурний, хто не знає (ще не народився той, хто все знає), а той, хто не хоче знати.",
        "«Ну, — казав сам собі, — навчайся, Сабаше, на чужій біді. На те-то й бʼють песика перед левом (як у притчі), щоб Лев був спинний»",
        "О насолодо! О ти диявольська вудко й сіте! Яка ти солодка, що всіх полонила! Яка ж згубна, як мало врятованих! Перше всі бачать, друге — вибрані!",
        "У цій маленькій місцині втілювалася простота і панувала дружба, що робить мале великим, дешеве — дорогим, а просте — приємним.",
        "Якщо будеш мудрим, то чужа біда навчить тебе, а нахабний і безсердечний син стане доброчесним через власну спокусу. І це біда.",
        "Яка користь читати багато книг і бути беззаконником?",
        "Глянь на цей світ. Оглянь рід людський. Він же є книга, книга чорна, яка вміщує всілякі біди, наче хвилі, що безперервно постають на морі. Читай же її завжди і вчися, одночасно начебто на бурхливий океан із високої гавані дивись і розважайся… Всі читають [цю книгу], але не осмислюючи.",
        "Тіло бачить тілом, а серце — серцем.",
        "Джерело є голова рік і морів. Сердечна ж безодня є голова й джерело всіх справ і всього світу. Бо світ є не що інше як звʼязок, або склад справ або створінь. І не що інше є віку цього Бог, як світове серце, джерело і голова світу.",
        "Якщо є два види створінь і справ, то є два серця. Якщо ж два серця, то і два духи: добрий і злий, істинний і хибний… За цими двома джерелами суди про будь-яку справу.",
        "Якщо насіння й корінь добрі, тоді добрі й гілки і плоди.",
        "Тінь себе не виправдовує, ані не осуджує. Вона залежить від своєї голови й суті.",
        "Від надміру ж серця, тобто із безодні його, говорять уста, ходять ноги, дивляться очі, творять руки.",
        "Це справжнє авраамове богословʼя — прозріти у всякій справі вміщеного духа: добрий він чи злий?",
        "Не судити з лиця, як лицеміри. Часто під злобним обличчям і під поганою личиною таїться божественне сяйво й блаженне серце, а в обличчі світлому, ангельському — сатана.",
        "Уникай печального, ревнивого й злого серця. Уникнеш, якщо не будеш заздрісним. Зітреш голову заздрісному змієві, якщо будеш вдячним за мале і сподіватимешся на Бога живого.",
        "Блаженний, хто розуміє причину будь-якої справи! Серце людське змінює її обличчя на добро або на зло.",
        "Добрій людині щодня — свято, а беззаконникові — ні Великдень…",
        "Якщо головою й джерелом всього світу є серце, то чи воно не корінь для свята? Мати святові є не час, а чисте серце.",
        "Памʼять є недремне сердечне око, що бачить всі створіння, не західне сонце, що просвітлює Всесвіт.",
        "О памʼять вранішня, як нетлінні крила! Тобою серце злітає у висоту, в глибину, в ширину безконечно, у стократ швидше від блискавки.",
        "Що таке памʼять? Це незабутність. Забуття греки називають ліфа, незабутність — аліфія; аліфія ж є істина. Яка істина? Це оця господня істина: «Я шлях, істина і життя». Христос господь. Бог наш, йому ж слава навіки, амінь!",
        "Людина дивиться на обличчя, а Бог дивиться на серце.",
        "Не той бідний, хто не має, а той, хто по вуха у багатстві ходить, та не докладає до нього серця, тобто на нього не надіється; готовий завжди, якщо Господу завгодно, позбутися з байдужістю. І це-то означає «убогі духом».",
        "Яка тобі користь від твоїх повних засіків, якщо твоя душа голодна й спрагла? Наповни безодню, насити спершу душу свою.",
        "Без Бога і нужда і багатство нечестиві. Немає ж бідніше, як нужда серед багатства, і немає блаженнішого, як серед нужди багатство.",
        "Нужда, що знайшла потрібне, знехтувала зайвим, є справжнє багатство і та блаженна середина, наче міст між болотом і болотом, між бідністю і надлишком.",
        "Бо що ж є система цього світу,як не храм Божий і дім його? У ньому нужда живе і священствує, приносить милість миру, жертву хвали , задовольняється, як дитя, тим, що їй дає Отець небесний, залежачи від його промислу й всесвітньої економії. І це означає: “Бо для тих є царство небесне”. Це — вони знають — промисел Божий, і на нього надіються. Тому нужда називається убогістю, що або, як дитя, живе у домі в Бога, або ж через те, що все своє має не в своїх руках, а у Бога. Не так нечестивий, не так. А наче порох від вихору, так залежать від себе самих, обожнюють свої скарби, сподіваються на свої зібрання, поки не засоромляться своїми ідолами. Через це називаються багатими, бо самі для себе є фальшивими богами."
      ]
    }
  ],
  "introSourceId": 27
}