{
  "urlId": "vstupni_dveri_do_khrystyianskoi_dobronravnosti",
  "orderNumber": 3,
  "treatiseType": "Катехізис",
  "complexity": "easy",
  "pagesCount": 10,
  "bibleCitationsTotal": 41,
  "bibleCitationsPerPage": 4,
  "writtenDate": [
    {
      "year": 1766,
      "text": "написаний 1766 р.",
      "sourceId": 1,
      "page": "259"
    },
    {
      "year": 1780,
      "text": "дописаний вступ 1780 р.",
      "sourceId": 3,
      "page": "222"
    }
  ],
  "versions": [
    {
      "translatorId": 0,
      "sourceId": 3,
      "title": "Начальная Дверь ко Христіанскому Добронравію",
      "fileNames": [
        "Г. С. Сковорода - Начальная Дверь ко Христїянскому Добронравїю - Л. Ушкалов.pdf"
      ]
    },
    {
      "translatorId": 2,
      "sourceId": 9,
      "title": "Вступні двері до християнської добронравності",
      "fileNames": [
        "Г. С. Сковорода - Вступні двері до християнської добронравності - В. Шевчук.pdf",
        "Г. С. Сковорода - Вступні двері до християнської добронравності - В. Шевчук.docx"
      ],
      "preferedVersion": true
    },
    {
      "translatorId": 3,
      "sourceId": 7,
      "title": "Вступні двері до християнської доброчесності",
      "fileNames": [
        "Г. С. Сковорода - Вступні двері до християнської доброчесності - В. Шевченко.pdf",
        "Г. С. Сковорода - Вступні двері до християнської доброчесності - В. Шевченко.docx"
      ]
    },
    {
      "translatorId": 4,
      "sourceId": 4,
      "title": "Вхідні двері до християнського доброчестя",
      "fileNames": []
    }
  ],
  "zmist": {
    "translatorId": 3,
    "list": [
      {
        "title": "Перед дверима"
      },
      {
        "title": "Твердь бесіди",
        "type": "seed"
      },
      {
        "title": "Глава 1-ша — Про Бога"
      },
      {
        "title": "Глава 2-га — Про вселенську віру"
      },
      {
        "title": "Глава 3-тя — Про спільний промисел"
      },
      {
        "title": "Глава 4-та — Про особливий щодо людини промисел"
      },
      {
        "title": "Глава 5-та — Про десятислів’я"
      },
      {
        "title": "Глава 6-та — Про істинну віру"
      },
      {
        "title": "Глава 7-ма — Благочестя й церемонії — різні речі"
      },
      {
        "title": "Глава 8-ма — Закон Божий і переказ — різні речі"
      },
      {
        "title": "Глава 9-та — Про пристрасті чи гріхи"
      },
      {
        "title": "Глава 10-та — Про любов або щиросердність"
      }
    ]
  },
  "quotes": [
    {
      "translatorId": 4,
      "texts": [
        {
          "text": "Подяка блаженному Богові за те, що потрібне зробив нетрудним, а трудне — непотрібним.",
          "themes": [ "Потрібне_Легке" ]
        },
        {
          "text": "Немає солодшого для людини й потрібнішого, як щастя; немає ж і нічого легшого. Подяка блаженному Богові. Царство Боже всередині нас. Щастя в серці, серце в любові, любов же у законі вічного.",
          "themes": [ "Потрібне_Легке", "Щастя", "Любов", "Серце" ]
        },
        {
          "text": "Яке ж то щастя, утверджене на піску плоті, на обмеженому місці й часі, на смертній людині? Чи не це трудне? Гей! Трудне й неможливе.",
          "themes": [ "Потрібне_Легке", "Щастя" ]
        },
        {
          "text": "Повітря і сонце завжди з тобою, всюди й задарма; все ж те, що втікає від тебе, знай, що воно чуже, і не вважай своїм, все те дивне й зайве. Яка ж тобі потреба? Тим-то воно й трудне. Ніколи б не розлучилося з тобою, якщо б було необхідне.",
          "themes": [ "Потрібне_Легке" ]
        },
        {
          "text": "Що ж тобі потрібне? … Потрібне лиш одне: «Єдине на потребу». Одне лиш тобі потрібне, одне ж лиш благе й легке, а все інше труд і хвороба. Що ж оте єдине? Бог.",
          "themes": [ "Потрібне_Легке" ]
        },
        {
          "text": "Подяка ж блаженному Богові за те, що все нас покидає, і все для нас трудне, крім того, що потрібне, любе й єдине.",
          "themes": [ "Потрібне_Легке" ]
        },
        {
          "text": "Весь світ складається з двох натур: одна — видима, інша — невидима. Видима натура називається створінням, а невидима — Бог. … Бог усі створіння пронизує й утримує; всюди завжди був, є і буде.",
          "themes": [ "Дві_Натури" ]
        },
        "Оскільки і тепер мало хто розуміє Бога, то не дивно, що й у давнину часто помилково вважали, що речовина є Богом і тому все своє боговшанування віддали на посміховисько.",
        "Всі віки і народи завжди однаково вірили в те, що є якась таємнича сила, яка по всьому розлита й усім володіє.",
        "Оця-то найблаженніша натура, або дух, … за прикладом отця-опікуна сама є буттям будь-якого створіння. Сама одушевляє, годує, розпоряджає, лагодить, захищає і своєю ж волею, яка називається всезагальним законом або статутом, перетворює знову в грубу матерію, або грязь, а ми це називаємо смертю.",
        "Бог через різні члени по-різному на спільну користь впливає",
        "Вона [мається на увазі найвища Божа премудрість] в усіх наших всілякого роду ділах і мові душа, користь і краса, а без неї все мертве і мерзенне. Народжуємося ми всі без неї, однак для неї. … Вона відрізняє нас від звірів милосердям і справедливістю, а від скотини — стриманістю й розумом; і є не чим іншим, як блаженнішим божим лицем, таємно виписаним на серці, силою і правилом усіх наших порухів і справ.",
        "Не той вірний цареві, хто намагається проникнути в його таємниці, а хто старанно виконує його волю",
        "Бог, Боже Слово, любов до Його Слова — то все одне. Цим триликим вогнем розпалене серце ніколи не согрішає, тому що не може мати злого насіння чи намірів",
        {
          "text": "Вся сила десятислів’я [маються на увазі Божі Заповіді, що їх записав Мойсей] вміщується в одному цьому імені — любов. Вона є вічний союз між Богом і людиною. Вона є невидимий вогонь, котрим запалюється серце до Божого Слова чи волі, а тому й сама вона є Бог.",
          "themes": [ "Любов" ]
        },
        "Закон Божий існує вічно, а людські перекази не скрізь і не завжди. Закон Божий є райське дерево, а людські перекази — тінь. Закон Божий є плід життя, а переказ — листя. Закон Божий є боже серце в людині, а переказ є листок смокви, що часто прикриває єхидну.",
        "Все те є переказ, що не Божий Закон.",
        "Пристрасть є морове повітря в душі.",
        "Найголовніша з усіх — заздрість, мати інших пристрастей та беззаконня. Вона є головним центром отої безодні, де мучиться душа."
      ]
    }
  ],
  "introSourceId": 27,
  "skovorodaLevel": "1-2",
  "relevantThemes": [
    "Потрібне_Легке",
    "Дві_Натури",
    "Щастя",
    "Любов",
    "Серце"
  ],
  "shortTitle": "Двері до доброчесності"
}