{
  "urlId": "narcis",
  "orderNumber": 4,
  "treatiseType": "Діалог",
  "writtenDate": [
    {
      "year": 1769,
      "text": "напиcаний 1769-1771 рр.",
      "sourceId": 3
    },
    {
      "year": 1780,
      "text": "нова редакція твору в середині 1780-x",
      "sourceId": 3
    },
    {
      "year": 1793,
      "text": "дописаний пролог 1793-1794 рр.",
      "sourceId": 3
    }
  ],
  "versions": [
    {
      "translatorId": 0,
      "sourceId": 3,
      "title": "Наркісс. Разглагол о том: Узнай Себе",
      "fileNames": [
        "Г. С. Сковорода - Наркісс. Разглагол о Том. Узнай себе - Л. Ушкалов.pdf"
      ]
    },
    {
      "translatorId": 2,
      "sourceId": 9,
      "title": "Наркіс. Розмова про те: Пізнай себе",
      "fileNames": [
        "Г. С. Сковорода - Наркіс. Розмова про Те. Пізнай себе - В. Шевчук.pdf"
      ],
      "preferedVersion": true
    }
  ],
  "quotes": [
    {
      "translatorId": 4,
      "texts": [
        "Образ Нарциса благовістить оце: “Пізнай себе!” Начебто сказав: чи хочеш бути задоволений собою і закохатися в самого себе? Пізнай же себе! Добре себе випробуй. Справді! Як бо можна закохатися в невідоме?... Не любить серце, не вбачаючи краси. Видко, любов є дочкою Софії [Мудрості]. Воістину благе самолюбство, якщо воно святе; гей святе, коли істинне…",
        "Мій мудрий Нарцис амуриться вдома, за притчею Соломоновою: “Розуму праведник собі другом буде”",
        "У що хто закохався, у те перетворився.",
        "Кожен є тим, чиє серце в ньому.",
        "Кожен є там, де серцем сам.",
        "Подяка ж блаженному Богові. Це його невимовна милість і влада, що зробила некорисне неможливим, а можливе корисним.",
        "Скажи мені, прекрасний Нарцисе, чи у твоїх водах ти щось побачив? Хто тобі в них зʼявився? Відповідь: Побачив я на полотні своєї минущої плоті не рукотворний образ, “який є сяйвом слави Отчої”.",
        "Так бачимо людей, як начебто хто показував тобі лиш людську ногу або пʼяту, закривши решту тіла й голову; без неї ж пізнати людину ніяк не можна. Ти й сам себе бачиш, але не розумієш і не осягаєш сам себе. А не розуміти себе самого, слово в слово є одне й те ж, що й втратити себе самого.",
        "Пізнати себе самого і відшукати себе самого і знайти людину — все це одне означає.",
        "Як же можеш твого друга розуміти й пізнати, якщо сам себе не розумієш і не маєш?",
        "Одне бачити тінь дуба, а інше — само справжнє дерево. Бачиш свою тінь, просто кажучи, свою порожнечу й ніщо. А самого себе ти зроду не бачив.",
        "Вухо, око, язик, руки, ноги і все наше зовнішнє тіло само собою нічого не діє і ні в чому. Та все воно підкорене нашим думкам. Думка, його володарка, перебуває у безперервному хвилюванні день і ніч. Вона-то розмірковує, радить, визначає, спонукає. А крайня наша плоть, як загнуздана скотина, або хвіст, мимоволі за нею слідує. Отож бачиш, що думка є наша головна точка й середня. А тому-то вона часто й називається серцем. Отже, не зовнішня наша плоть, а наша думка, — то наша головна людина. У ній-то ми є. А вона є нами.",
        "Не поспішай! Хто швидко припадає до нової думки, той швидко і відпадає. Не будь легко вірним. Випробовуй обережно кожне слово. Тоді давай місце йому у твоєму серці.",
        "Спершу добре розжуй. Потім у радості й у простоті серця приймай. Будь простим. Але й будь при тому обережним.",
        "Що раптом запалюється, те раптом і згасає. Та тверде діло постійно міцніє, тому що немає поради без повільності.",
        "Віра, що бачить світло у пітьмі, страх божий, що пронизує плоть, міцна, як смерть, любов божа — ось єдині двері до райського смаку.",
        "Віра дивиться на те, чого порожнє твоє око не може бачити.",
        "Пусте твоє око дивиться у всьому на пустоту. А якщо б ти мав у собі істинну людину, то ти б її оком міг у всьому побачити істину.",
        "Справжнє око і віра — одне й те ж.",
        "Істинна людина має істинне око, яке оскільки, обминаючи видимість, бачить під нею новизну і на ній спочиває, тому називається вірою. А вірити й покластися на щось, як на тверду основу, то все одно.",
        "Якщо цього дуба не буде, то чи буде стояти тінь?",
        "Ти сон істинної твоєї людини. Ти риза, а вона тіло. Ти привид, а вона в тобі істина. Ти-то ніщо, а вона в тобі — єство. Ти бруд, а вона твоя краса, образ і план, не твій образ і не твоя краса, оскільки не від тебе [вона є], а в тобі лише і [тебе] утримує.",
        "Прийде той богообіцяний день, в який чистої душі благословенне слово знищить оцю твою лукаву раду: “Той зітре твою голову”",
        "Фарби є не що інше, як порох і порожнеча: малюнок або пропорція і розміщення фарб — це сила. А якщо її немає, тоді фарба — бруд і лише порожнеча.",
        "Дух все-все виліплює. Дух і утримує.",
        "Якщо хочемо виміряти небо, землю і моря, то ми повинні, по-перше, змірити себе самих з Павлом нашою власною мірою. А якщо нашої, всередині нас, міри не знайдемо, то чим можемо виміряти? А не вимірявши спершу себе, яка користь знати міру в інших створіннях? Та й чи можна? … Чи може міряти, коли не бачить землі? Чи може бачити, коли не бачить її голови? Чи може побачити голову й силу її, не знайшовши й не зрозумівши своєї в собі самому? Голова розуміється головою, а сила — силою.",
        "Слово Боже, поради і думки Його — це план, що нечутно простерся по всьому матеріалу Всесвіту, який все утримує і наповнює. Це глибина багатства і премудрості Його.",
        "Що може розлитися ширше, ніж думка? О серце, безодня, ширша за всі води й небеса!.. Яка ти глибока! Все обіймаєш і утримуєш, а тебе не вміщує ніщо."
      ]
    }
  ],
  "zmist": {
    "translatorId": 4,
    "list": [
      "Пролог",
      "Чудо, що зʼявилося у водах Нарцисові",
      "Розмова про те: знай себе",
      "Розмова 2-га про те: знай себе",
      "Розмова 3-тя про те ж: знай себе",
      "Розмова 4-та про те ж: знай себе",
      "Розмова 5-та про те ж: знай себе",
      "Розмова 6-та про те ж: знай себе",
      "Розмова 7-ма. Про істинну людину, або про воскресіння",
      "Симфонія, тобто погодження священних слів із таким віршем: “Сказав: збережу шляхи мої, щоб не згрішити моїм язиком...”",
      "Хор",
      "Симфонія",
      "Симфонія",
      "Симфонія",
      "Симфонія"
    ]
  },
  "introSourceId": 27
}